Revit 2027 API
ColorFillScheme.SetFormatOptions Method
 Sets the FormatOptions of the scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFormatOptions(
	FormatOptions formatOptions
)
Public Sub SetFormatOptions (
	formatOptions As FormatOptions
)
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
member SetFormatOptions :
        formatOptions : FormatOptions -> unit
Parameters
formatOptions FormatOptions
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This method will set the FormatOptions if the scheme is by range, otherwise do nothing.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace